src/InformationRegisters/ЖурналКонтроля/ЖурналКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналКонтроля</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЖурналКонтроля/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция УдалитьУстаревшиеДанные(КрайняяДатаЗаписи) Экспорт
	
	ЕстьУдаление = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Период КАК Период
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		ДатаЗаписи КАК Период
	|	ИЗ
	|		РегистрСведений.ЖурналКонтроля
	|	ГДЕ
	|		ДатаЗаписи <= &КрайняяДатаЗаписи
	|	УПОРЯДОЧИТЬ ПО
	|		ДатаЗаписи ВОЗР
	|	) КАК Выборка
	|";
	
	Запрос.УстановитьПараметр("КрайняяДатаЗаписи", КрайняяДатаЗаписи);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ЕстьУдаление = Истина;
		
		НаборЗаписей = РегистрыСведений.ЖурналКонтроля.СоздатьНаборЗаписей();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей.Отбор.ДатаЗаписи.Установить(Выборка.Период);
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьУдаление;
	
КонецФункции

#КонецЕсли
